---
kind: property
id: P:Autodesk.Revit.DB.ThermalProperties.HeatTransferCoefficient
source: html/fbedc21e-9c5e-7197-917e-70996023126d.htm
---
# Autodesk.Revit.DB.ThermalProperties.HeatTransferCoefficient Property

The heat transfer coefficient value (U-Value).
 The unit is watts per meter-squared kelvin (W/(m^2*K)).

## Syntax (C#)
```csharp
public double HeatTransferCoefficient { get; }
```